[
    {
        "id": 1,
        "title": "The Shawshank Redemption",
        "year": 1994,
        "director": "Frank Darabont",
        "genre": "Drama",
        "description": "Over the course of several years, two convicts form a friendship, seeking consolation and, eventually, redemption through basic compassion.",
        "rating": "9"
    },
    {
        "id": 2,
        "title": "The Godfather",
        "year": 1972,
        "director": "Francis Ford Coppola",
        "genre": "Crime",
        "description": "The aging patriarch of an organized crime dynasty transfers control of his clandestine empire to his reluctant son.",
        "rating": "9"
    },
    {
        "id": 3,
        "title": "The Dark Knight",
        "year": 2008,
        "director": "Christopher Nolan",
        "genre": "Action",
        "description": "When the menace known as the Joker wreaks havoc and chaos on the people of Gotham, Batman must accept one of the greatest psychological and physical tests of his ability to fight injustice.",
        "rating": "9"
    },
    {
        "id": 4,
        "title": "Schindler's List",
        "year": 1993,
        "director": "Steven Spielberg",
        "genre": "Biography",
        "description": "In German-occupied Poland during World War II, industrialist Oskar Schindler gradually becomes concerned for his Jewish workforce after witnessing their persecution by the Nazis.",
        "rating": "9"
    },
    {
        "id": 5,
        "title": "Interstellar",
        "year": 2014,
        "director": "Christopher Nolan",
        "genre": "Drama",
        "description": "When Earth becomes uninhabitable in the future, a farmer and ex-NASA pilot, Joseph Cooper, is tasked to pilot a spacecraft, along with a team of researchers, to find a new planet for humans.",
        "rating": "9"
    },
    {
        "id": 6,
        "title": "The Lord of the Rings: The Return of the King",
        "year": 2003,
        "director": "Peter Jackson",
        "genre": "Adventure",
        "description": "Gandalf and Aragorn lead the World of Men against Sauron's army to draw his gaze from Frodo and Sam as they approach Mount Doom with the One Ring.",
        "rating": "9"
    },
    {
        "id": 7,
        "title": "Forrest Gump",
        "year": 1994,
        "director": "Robert Zemeckis",
        "genre": "Drama",
        "description": "The history of the United States from the 1950s to the '70s unfolds from the perspective of an Alabama man with an IQ of 75, who yearns to be reunited with his childhood sweetheart.",
        "rating": "9"
    },
    {
        "id": 8,
        "title": "Inception",
        "year": 2010,
        "director": "Christopher Nolan",
        "genre": "Action",
        "description": "A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a C.E.O., but his tragic past may doom the project and his team to disaster.",
        "rating": "9"
    },
    {
        "id": 9,
        "title": "Fight Club",
        "year": 1999,
        "director": "David Fincher",
        "genre": "Drama",
        "description": "An insomniac office worker and a devil-may-care soap maker form an underground fight club that evolves into much more.",
        "rating": "9"
    },
    {
        "id": 10,
        "title": "The Matrix",
        "year": 1999,
        "director": "Lana Wachowski, Lilly Wachowski",
        "genre": "Action",
        "description": "When a beautiful stranger leads computer hacker Neo to a forbidding underworld, he discovers the shocking truth--the life he knows is the elaborate deception of an evil cyber-intelligence.",
        "rating": "9"
    },
    {
        "id": 11,
        "title": "The Matrix Reloaded",
        "year": 2003,
        "director": "Lana Wachowski, Lilly Wachowski",
        "genre": "Action",
        "description": "Freedom fighters Neo, Trinity and Morpheus continue to lead the revolt against the Machine Army, unleashing their arsenal of extraordinary skills and weaponry against the systematic forces of repression and exploitation.",
        "rating": "9"
    },
    {
        "id": 12,
        "title": "The Matrix Revolutions",
        "year": 2004,
        "director": "Lana Wachowski, Lilly Wachowski",
        "genre": "Action",
        "description": "The human city of Zion defends itself against the massive invasion of the machines as Neo fights to end the war at another front while also opposing the rogue Agent Smith.",
        "rating": "9"
    },
    {
        "id": 13,
        "title": "The Matrix Resurrections",
        "year": 2021,
        "director": "Lana Wachowski, Lilly Wachowski",
        "genre": "Action",
        "description": "Return to a world of two realities: one, everyday life; the other, what lies behind it. To find out if his reality is a construct, to truly know himself, Mr. Anderson will have to choose to follow the white rabbit once more.",
        "rating": "9"
    },
    {
        "id": 14,
        "title": "Oppenheimer",
        "year": "2023",
        "director": "Christopher Nolan",
        "genre": "Drama",
        "description": "The story of American scientist J. Robert Oppenheimer and his role in the development of the atomic bomb.",
        "rating": "9"
    }
]